app/Http/Controllers/DashboardPostController.php

SELECT * FROM `berandas`
---
    public function index()
    {
        return view('admin.posts.index',[
            'posts' => Beranda::all()
        ]);

SELECT * FROM `categories`
---
    public function create()
    {
        return view('admin.posts.create', [
            'categories'=> Category::all()
        ]);

SELECT * FROM `berandas` WHERE `berandas`.`id` = '10' LIMIT 1
---
    public function show($id)
    {
        // return $beranda;
        //  echo $id;
        $data['beranda'] = Post::find($id);

SELECT * FROM `categories`
---
    public function edit(Post $post)
    {

        return view('admin.posts.edit', [
            'beranda' => $post,
            'categories'=> Category::all()
        ]);